# Игра "Виселица":
#
# Задача: Напишите программу, которая реализует игру "Виселица".
# Программа должна загадать слово, а пользователь должен угадывать буквы.
# За каждую неправильную букву рисуется часть виселицы.
# Игра заканчивается, когда пользователь угадает слово или когда виселица будет полностью нарисована.

import random as r
from collections import Counter


def can_make_word(word, letters):
    word_counter = Counter(word)
    letters_counter = Counter(letters)
    for char, count in word_counter.items():
        if letters_counter[char] < count:
            return False
    return True


listWords = [
    'Солнце',
    'Море',
    'Гора',
    'Лес',
    'Река',
    'Ветер',
    'Дождь',
    'Снег',
    'Облако',
    'Звезда'
]

image = [
    '.....+%%%%%%%%%%%%%%%%%%%%%%%%%%%%*:.......\n.....*@@@@@@@@@@@@@@@@@@@@@@@@@@@@%:.......\n.....*@@@@@@@@@@@@@@@@@@@@@@@@@@@@%:.......',
    '.....*@@@@@+======#@@@+=======+@*=-........\n.....*@@@@@=....+@@@+.........:@=..........\n.....*@@@@@=..=@@@+...........:@=..........',
    '.....*@@@@@==@@@*.............:@=..:-*:....\n.....*@@@@@@@@*:..............:*=-##=......\n.....*@@@@@@+................-%%%:.........',
    '.....*@@@@@=................:*####-........\n.....*@@@@@=.................:-==:.........\n.....*@@@@@=..................%%@=.........',
    '.....*@@@@@=.................+@--@=........\n.....*@@@@@=................:@#..+%:.......\n.....*@@@@@=................+@:..:@=.......',
    '.....*@@@@@=................=@+..:@=.......\n.....*@@@@@=.................=@%#@*:.......\n.....*@@@@@=...................::..........',
    '.....*@@@@@=...............................\n.....*@@@@@=...............................\n.....*@@@@@=...............................',
    '.....*@@@@@=...............................\n.....*@@@@@=...............................\n.....*@@@@@=...............................',
    '.....*@@@@@=...............................\n.....*@@@@@=...............................\n.....*@@@@@=...............................',
    '.....*@@@@@=...............................\n.....*@@@@@=...............................\n.....*@@@@@=...............................',
]

word = r.choice(listWords)

letterUser = []

t = 0
while t < len(image):
    print('Введи букву: ')
    letter = str(input())
    if letter not in word.lower():
        t += 1
        for i in range(t):
            print(image[i])
    else:
        letterUser.append(letter)
    for i in word.lower():
        print(f'[{i if i in letterUser else " " }]', end='')
    print('\n\n\n')
    if can_make_word(word, letterUser):
        print("Вы выйграли!")
        break

if not can_make_word(word, letterUser):
    print('Вы проиграли!')